using System;

namespace _20240610_Variable
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // 변수 생성 규칙
            // 변수는 값을 담는 메모리 공간
            // 변수명은 나중에 할당될 메모리 공간을 대신하고 있다.

            // DataType 변수명; // ;은 명령이 끝났다는 표시

            int a;

            // 변수명의 명명규칙은
            // 영대소문자, _, 숫자 가능
            // 1. 첫글자는 영대소문자
            // 2. 숫자는 첫글자 다음에 올 수 있다.
            // 3. 변수명의 길이는 255자 이하 공백 포함이 안된다
            // 4. 유니코드를 지원해서 영어, 한글, 한자등 사용이 가능
            //    될 수 있으면 영문자를 사용하는게 좋음 특수기호는 변수명에 사용이 불가능
            // 5. 키워드(예약어나 메서드의 이름)은 변수명으로 사용이 안된다.
            // 6. 변수명은 변수에 담길 값을 표현하는 문자나 문장을 사용하는 것이 좋다.
            //    int score;

        }
    }
}
